Revit 2024 API
BuiltInFailures.PointFailures.HostParameterRangeError Property
 Hosted Parameter must be between 0 and 1
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId HostParameterRangeError { get; }
Visual Basic
Public Shared ReadOnly Property HostParameterRangeError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ HostParameterRangeError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.PointFailures Class
Autodesk.Revit.DB Namespace